{
  "competences": [
    {
      "nom": "CSS",
      "niveau": "Autonome",
      "description": "Je maîtrise bien le CSS, notamment Flexbox, les animations, et je crée des designs réactifs. Je ne maîtrise pas encore bien Grid."
    },
    {
      "nom": "Sass",
      "niveau": "Autonome",
      "description": "Je maîtrise Sass et l'utilise pour structurer mes styles avec des mixins, des variables et de l'imbrication, ce qui optimise la gestion de projets complexes."
    },
    {
      "nom": "JavaScript",
      "niveau": "Intermédiaire",
      "description": "Bonne maîtrise du JavaScript moderne (ES6+), notamment pour la manipulation du DOM et la programmation asynchrone, avec encore des aspects à approfondir."
    },
    {
      "nom": "Python",
      "niveau": "Débutant",
      "description": "Bonne compréhension des bases de Python, notamment pour écrire des scripts simples, manipuler des données, et automatiser des tâches de base."
    },
    {
       "nom": "Git",
      "niveau": "Débutant",
      "description": "Je maîtrise les bases de Git (commit, clone, push), mais je ne maîtrise pas encore la gestion des branches et les workflows collaboratifs."
    },
    {
      "nom": "MongoDB",
      "niveau": "Débutant",
      "description": "Je peux utiliser MongoDB pour des bases de données NoSQL, notamment pour la gestion de données non structurées et la création d'API RESTful."
    },
    {
      "nom": "React",
      "niveau": "Solide",
      "description": "Je maîtrise bien React pour construire des interfaces dynamiques et performantes. J'ai une bonne compréhension des hooks, et je suis capable d'en créer des efficaces pour gérer l'état et les effets. Cependant, je continue d'apprendre pour perfectionner l'utilisation des hooks dans des scénarios plus complexes."
    },
    {
      "nom": "HTML",
      "niveau": "Autonome",
      "description": "Bonne maîtrise du HTML pour structurer des pages web de manière sémantique et efficace, tout en respectant les bonnes pratiques."
    },
    {
      "nom": "Express",
      "niveau": "Intermédiaire",
      "description": "Je peux utiliser Express.js pour développer des API backend efficaces et gérer la logique serveur dans des applications Node.js."
    }
  ]
}
